
## Plan Result (sandbox)




<pre><code>Plan: 43 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.elastic_search_url_key_setting
  * azurerm_key_vault_secret.es_data_nodes_url
  * random_password.vm_password
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0]
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk1&#34;]
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk2&#34;]
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.azurerm_network_interface.vm_nic
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;disk1&#34;]
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;disk2&#34;]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk1&#34;]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk2&#34;]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.azurerm_network_interface.vm_nic
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;disk1&#34;]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;disk2&#34;]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk1&#34;]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk2&#34;]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.azurerm_network_interface.vm_nic
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;disk1&#34;]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;disk2&#34;]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk1&#34;]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.azurerm_managed_disk.managed_disks[&#34;disk2&#34;]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.azurerm_network_interface.vm_nic
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;disk1&#34;]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;disk2&#34;]
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.linux_vm_dcra[0]
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.linux_vm_dcra[0]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.linux_vm_dcra[0]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.linux_vm_dcra[0]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.elastic_search_url_key_setting will be created
  + resource "azurerm_key_vault_secret" "elastic_search_url_key_setting" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-shared-sandbox/providers/Microsoft.KeyVault/vaults/ccd-sandbox"
      + name                    = "ccd-ELASTIC-SEARCH-URL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.es_data_nodes_url will be created
  + resource "azurerm_key_vault_secret" "es_data_nodes_url" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/ccd-shared-sandbox/providers/Microsoft.KeyVault/vaults/ccd-sandbox"
      + name                    = "ccd-ELASTIC-SEARCH-DATA-NODES-URL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # random_password.vm_password will be created
  + resource "random_password" "vm_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 1
      + min_numeric      = 1
      + min_special      = 0
      + min_upper        = 1
      + number           = true
      + numeric          = true
      + override_special = "#$%&@()_[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0] will be created
  + resource "azurerm_linux_virtual_machine" "linvm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "ccdadmin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = true
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "uksouth"
      + max_bid_price                                          = -1
      + name                                                   = "ccd-data-0"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "AutomaticByPlatform"
      + patch_mode                                             = "AutomaticByPlatform"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "ccd-elastic-search-sandbox"
      + size                                                   = "Standard_D4ds_v5"
      + tags                                                   = (known after apply)
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + boot_diagnostics {}

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 30
          + id                        = (known after apply)
          + name                      = "ccd-data-0-osdisk"
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "ubuntu-24_04-lts"
          + publisher = "Canonical"
          + sku       = "server"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk1"] will be created
  + resource "azurerm_managed_disk" "managed_disks" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 1024
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "ccd-data-0-datadisk1"
      + network_access_policy             = "AllowAll"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "ccd-elastic-search-sandbox"
      + source_uri                        = (known after apply)
      + storage_account_type              = "StandardSSD_LRS"
      + tags                              = (known after apply)
      + tier                              = (known after apply)
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk2"] will be created
  + resource "azurerm_managed_disk" "managed_disks" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 1024
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "ccd-data-0-datadisk2"
      + network_access_policy             = "AllowAll"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "ccd-elastic-search-sandbox"
      + source_uri                        = (known after apply)
      + storage_account_type              = "StandardSSD_LRS"
      + tags                              = (known after apply)
      + tier                              = (known after apply)
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.azurerm_network_interface.vm_nic will be created
  + resource "azurerm_network_interface" "vm_nic" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "uksouth"
      + mac_address                    = (known after apply)
      + name                           = "ccd-data-0-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "ccd-elastic-search-sandbox"
      + tags                           = (known after apply)
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ccd-data-0-ipconfig"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.100.157.10"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-sandbox/subnets/elasticsearch"
        }
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["disk1"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["disk2"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 1
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0] will be created
  + resource "azurerm_linux_virtual_machine" "linvm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "ccdadmin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = true
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "uksouth"
      + max_bid_price                                          = -1
      + name                                                   = "ccd-data-1"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "AutomaticByPlatform"
      + patch_mode                                             = "AutomaticByPlatform"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "ccd-elastic-search-sandbox"
      + size                                                   = "Standard_D4ds_v5"
      + tags                                                   = (known after apply)
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + boot_diagnostics {}

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 30
          + id                        = (known after apply)
          + name                      = "ccd-data-1-osdisk"
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "ubuntu-24_04-lts"
          + publisher = "Canonical"
          + sku       = "server"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk1"] will be created
  + resource "azurerm_managed_disk" "managed_disks" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 1024
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "ccd-data-1-datadisk1"
      + network_access_policy             = "AllowAll"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "ccd-elastic-search-sandbox"
      + source_uri                        = (known after apply)
      + storage_account_type              = "StandardSSD_LRS"
      + tags                              = (known after apply)
      + tier                              = (known after apply)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk2"] will be created
  + resource "azurerm_managed_disk" "managed_disks" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 1024
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "ccd-data-1-datadisk2"
      + network_access_policy             = "AllowAll"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "ccd-elastic-search-sandbox"
      + source_uri                        = (known after apply)
      + storage_account_type              = "StandardSSD_LRS"
      + tags                              = (known after apply)
      + tier                              = (known after apply)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.azurerm_network_interface.vm_nic will be created
  + resource "azurerm_network_interface" "vm_nic" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "uksouth"
      + mac_address                    = (known after apply)
      + name                           = "ccd-data-1-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "ccd-elastic-search-sandbox"
      + tags                           = (known after apply)
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ccd-data-1-ipconfig"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.100.157.11"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-sandbox/subnets/elasticsearch"
        }
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["disk1"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["disk2"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 1
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0] will be created
  + resource "azurerm_linux_virtual_machine" "linvm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "ccdadmin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = true
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "uksouth"
      + max_bid_price                                          = -1
      + name                                                   = "ccd-data-2"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "AutomaticByPlatform"
      + patch_mode                                             = "AutomaticByPlatform"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "ccd-elastic-search-sandbox"
      + size                                                   = "Standard_D4ds_v5"
      + tags                                                   = (known after apply)
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + boot_diagnostics {}

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 30
          + id                        = (known after apply)
          + name                      = "ccd-data-2-osdisk"
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "ubuntu-24_04-lts"
          + publisher = "Canonical"
          + sku       = "server"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk1"] will be created
  + resource "azurerm_managed_disk" "managed_disks" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 1024
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "ccd-data-2-datadisk1"
      + network_access_policy             = "AllowAll"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "ccd-elastic-search-sandbox"
      + source_uri                        = (known after apply)
      + storage_account_type              = "StandardSSD_LRS"
      + tags                              = (known after apply)
      + tier                              = (known after apply)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk2"] will be created
  + resource "azurerm_managed_disk" "managed_disks" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 1024
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "ccd-data-2-datadisk2"
      + network_access_policy             = "AllowAll"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "ccd-elastic-search-sandbox"
      + source_uri                        = (known after apply)
      + storage_account_type              = "StandardSSD_LRS"
      + tags                              = (known after apply)
      + tier                              = (known after apply)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.azurerm_network_interface.vm_nic will be created
  + resource "azurerm_network_interface" "vm_nic" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "uksouth"
      + mac_address                    = (known after apply)
      + name                           = "ccd-data-2-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "ccd-elastic-search-sandbox"
      + tags                           = (known after apply)
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ccd-data-2-ipconfig"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.100.157.12"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-sandbox/subnets/elasticsearch"
        }
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["disk1"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["disk2"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 1
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.azurerm_linux_virtual_machine.linvm[0] will be created
  + resource "azurerm_linux_virtual_machine" "linvm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "ccdadmin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = true
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "uksouth"
      + max_bid_price                                          = -1
      + name                                                   = "ccd-data-3"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "AutomaticByPlatform"
      + patch_mode                                             = "AutomaticByPlatform"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "ccd-elastic-search-sandbox"
      + size                                                   = "Standard_D4ds_v5"
      + tags                                                   = (known after apply)
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + boot_diagnostics {}

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 30
          + id                        = (known after apply)
          + name                      = "ccd-data-3-osdisk"
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "ubuntu-24_04-lts"
          + publisher = "Canonical"
          + sku       = "server"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk1"] will be created
  + resource "azurerm_managed_disk" "managed_disks" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 1024
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "ccd-data-3-datadisk1"
      + network_access_policy             = "AllowAll"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "ccd-elastic-search-sandbox"
      + source_uri                        = (known after apply)
      + storage_account_type              = "StandardSSD_LRS"
      + tags                              = (known after apply)
      + tier                              = (known after apply)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.azurerm_managed_disk.managed_disks["disk2"] will be created
  + resource "azurerm_managed_disk" "managed_disks" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 1024
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "ccd-data-3-datadisk2"
      + network_access_policy             = "AllowAll"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "ccd-elastic-search-sandbox"
      + source_uri                        = (known after apply)
      + storage_account_type              = "StandardSSD_LRS"
      + tags                              = (known after apply)
      + tier                              = (known after apply)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.azurerm_network_interface.vm_nic will be created
  + resource "azurerm_network_interface" "vm_nic" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "uksouth"
      + mac_address                    = (known after apply)
      + name                           = "ccd-data-3-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "ccd-elastic-search-sandbox"
      + tags                           = (known after apply)
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ccd-data-3-ipconfig"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.100.157.13"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-sandbox/subnets/elasticsearch"
        }
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["disk1"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["disk2"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 1
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.linux_vm_dcra[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "linux_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-linux-vm-logs"
      + description             = "Association between a linux VM and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = (known after apply)
      + target_resource_id      = (known after apply)
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] will be created
  + resource "azurerm_virtual_machine_extension" "azure_monitor" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AMALinux"
      + publisher                   = "Microsoft.Azure.Monitor"
      + tags                        = (known after apply)
      + type                        = "AzureMonitorLinuxAgent"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = (known after apply)
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSBootstrapScript"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Azure.Extensions"
      + tags                        = (known after apply)
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = (known after apply)
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be created
  + resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "Dynatrace"
      + publisher                   = "dynatrace.ruxit"
      + settings                    = (sensitive value)
      + tags                        = (known after apply)
      + type                        = "oneAgentLinux"
      + type_handler_version        = "2.200"
      + virtual_machine_id          = (known after apply)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.linux_vm_dcra[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "linux_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-linux-vm-logs"
      + description             = "Association between a linux VM and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = (known after apply)
      + target_resource_id      = (known after apply)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] will be created
  + resource "azurerm_virtual_machine_extension" "azure_monitor" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AMALinux"
      + publisher                   = "Microsoft.Azure.Monitor"
      + tags                        = (known after apply)
      + type                        = "AzureMonitorLinuxAgent"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = (known after apply)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSBootstrapScript"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Azure.Extensions"
      + tags                        = (known after apply)
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = (known after apply)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be created
  + resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "Dynatrace"
      + publisher                   = "dynatrace.ruxit"
      + settings                    = (sensitive value)
      + tags                        = (known after apply)
      + type                        = "oneAgentLinux"
      + type_handler_version        = "2.200"
      + virtual_machine_id          = (known after apply)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.linux_vm_dcra[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "linux_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-linux-vm-logs"
      + description             = "Association between a linux VM and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = (known after apply)
      + target_resource_id      = (known after apply)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] will be created
  + resource "azurerm_virtual_machine_extension" "azure_monitor" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AMALinux"
      + publisher                   = "Microsoft.Azure.Monitor"
      + tags                        = (known after apply)
      + type                        = "AzureMonitorLinuxAgent"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = (known after apply)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSBootstrapScript"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Azure.Extensions"
      + tags                        = (known after apply)
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = (known after apply)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be created
  + resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "Dynatrace"
      + publisher                   = "dynatrace.ruxit"
      + settings                    = (sensitive value)
      + tags                        = (known after apply)
      + type                        = "oneAgentLinux"
      + type_handler_version        = "2.200"
      + virtual_machine_id          = (known after apply)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.linux_vm_dcra[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "linux_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-linux-vm-logs"
      + description             = "Association between a linux VM and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = (known after apply)
      + target_resource_id      = (known after apply)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] will be created
  + resource "azurerm_virtual_machine_extension" "azure_monitor" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AMALinux"
      + publisher                   = "Microsoft.Azure.Monitor"
      + tags                        = (known after apply)
      + type                        = "AzureMonitorLinuxAgent"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = (known after apply)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSBootstrapScript"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Azure.Extensions"
      + tags                        = (known after apply)
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = (known after apply)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be created
  + resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "Dynatrace"
      + publisher                   = "dynatrace.ruxit"
      + settings                    = (sensitive value)
      + tags                        = (known after apply)
      + type                        = "oneAgentLinux"
      + type_handler_version        = "2.200"
      + virtual_machine_id          = (known after apply)
    }

Plan: 43 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label sandbox/add-or-update: POST https://api.github.com/repos/hmcts/ccd-elastic-search/issues/129/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":129,"Program":"tfcmt","SHA1":"","Target":"sandbox","Vars":{}} -->